In [1]:
import pandas as pd
df = pd.read_csv("occupation.csv",delimiter = "|")
df

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [2]:
#Display the first 10 rows
result = df.head(10)
print("First 10 rows of the DataFrame:")
print(result)

First 10 rows of the DataFrame:
   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
1        2   53      F          other    94043
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344
7        8   36      M  administrator    05201
8        9   29      M        student    01002
9       10   53      M         lawyer    90703

In [3]:
#Display the last 10 rows
result = df.tail(10)
print("Last 10 rows of the DataFrame:")
print(result)

Last 10 rows of the DataFrame:
     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

In [4]:
#print total no. of observations in a df
index = df.index
number_of_rows = len(index)
print(number_of_rows)

943

In [5]:
#print no. of columns and name of all the columns
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [6]:
#print datatype of each column
df.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [7]:
#unique occupation in dataframe with corresponding no. of records
df['occupation'].value_counts(ascending=True)

homemaker          7
doctor             7
none               9
salesman          12
lawyer            12
retired           14
healthcare        16
entertainment     18
marketing         26
technician        27
artist            28
scientist         31
executive         32
writer            45
librarian         51
programmer        66
engineer          67
administrator     79
educator          95
other            105
student          196
Name: occupation, dtype: int64

In [10]:
#calculate average age of all record

print(df['age'].mean())

34.05196182396607

In [12]:
#calculate the average age of all records grouped by their gender
df.groupby(['gender']).mean()

           user_id        age
gender
F       481.406593  33.813187
M       468.167164  34.149254

In [18]:
#For each occupaation calculate the proportion of male and females
p= df.groupby(by=['occupation'])['gender'].value_counts(normalize=True).mul(100).round(1)
print(p)

occupation     gender
administrator  M          54.4
               F          45.6
artist         M          53.6
               F          46.4
doctor         M         100.0
educator       M          72.6
               F          27.4
engineer       M          97.0
               F           3.0
entertainment  M          88.9
               F          11.1
executive      M          90.6
               F           9.4
healthcare     F          68.8
               M          31.2
homemaker      F          85.7
               M          14.3
lawyer         M          83.3
               F          16.7
librarian      F          56.9
               M          43.1
marketing      M          61.5
               F          38.5
none           M          55.6
               F          44.4
other          M          65.7
               F          34.3
programmer     M          90.9
               F           9.1
retired        M          92.9
               F           7.1
salesman       M          75.0
               F          25.0
scientist      M          90.3
               F           9.7
student        M          69.4
               F          30.6
technician     M          96.3
               F           3.7
writer         M          57.8
               F          42.2
Name: gender, dtype: float64